# pattern_replacement_A.py
patterns_general = {
    'त्रि बि': 'त्रि वि', 'नेराप्रवि': 'नेरा प्रा वि', 'प्रा बाग्लुङ': 'प्रा वि बाग्लुङ', 
    'निमा': 'नि मा', 'भूमे प्रा िचितवन': 'भूमे प्रा वि चितवन', 'माध्यमिक': 'मा', 
    'विद्यालय': 'वि', 'निम्न': 'नि', 'प्रा ली': 'प्रा लि', 'विधालय': 'वि', 
    'प्राथमिक': 'प्रा', 'आधारभूत': 'आ', 'बिधालय': 'वि', 'बिद्यालय': 'वि', 
    'विदोकानडाँडा': 'वि दोकानडाँडा', 'दरवार हाइस्कुल': 'दरवार हाइस्कुल मा वि', 
    r'\bबी\b': 'बि', r'\bबि\b': 'वि', 'तनहु': 'तनहुँ', 'नि मा िपर्बत': 'नि मा वि पर्बत', 
    'नि म बि': 'नि मा वि', 'नि वा': 'नि मा वि', 'त्रि वि': 'त्रिवि', 'मा ि': 'मा वि', 
    'नेराप्रा।वि': 'नेरा प्रा वि', 'वि पी': 'विपी', 'तनहूँ': 'तनहुँ', 'तनुहुँ': 'तनहुँ', 
    'धनकुटा थाकले': 'थाकले धनकुटा', 'नेराप्रा वि': 'नेरा प्रा वि', 
    'निङ्गलाखसैनी बेतडि आ वि': 'निङ्गलाखसैनी आ वि बेतडि', 
    'सरस्वती आ वि मा वि अर्खौले': 'सरस्वती-आवि मा वि अर्खौले', 'ने रा वि': 'नेरावि', 
    'ना वि मा': "नि वि मा", 'वि मा वि' :'नि मा वि', 'विा': 'वि','कालीका मा':'कालीका मा वि'
}

patterns_ma_vi = [
    'माबी', 'उ म बि', 'मवि', 'म्ाा बी', 'उ०मा०वि', 'उच्च मा', 
    'उच्चमा', 'उमा वि', 'माध्यामिक वि', 'मा वी', 'मा बी', 'मावि', 
    'माबि', 'मा बि', 'मावी', 'उ मा वि','माध्यमिक','म वि','उ मा'
]

patterns_pra_vi = [
    'प्राबि','प्रो वि', 'प्रावि','प्रा॰वऽि', 'प्रा बि', 'प्र बि', 'प्राबी', 'प्रँ ीव्', 
    'प््राा वि', 'प्र्रा वि', 'प्रा बी', 'प्रा वी', 'प्र वि', 'प्रावी', 
    'प््राा वि', 'प्रा ब', 'प्रवि', 'प्ा बि', 'प्रा ि', 'प्रा। वी', 
    'प्र वी', 'प्रा स्कूल', 'प्राइमरी स्कुलप्रोवि', 'प्राथमीक वि', 
    'प््राावि', 'जप्र्रावि', 'प्रावऽि','प्रँ बि'
]

patterns_ni_ma = [
    'नि म', 'नि मा।वि', 'नि मा विा वि'
]

patterns_aa_vi = [
    'आवि', 'आबि'
]
